

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьТаблицу(Команда)
	
    ДлительнаяОперация = ЗаполнитьНаСервере(Объект.Период);
    
    ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
    ПараметрыОжидания.Интервал = 1;
    ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
    
    Завершение = Новый ОписаниеОповещения("ЗавершенитьПроцедуру", ЭтотОбъект);
    ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Завершение, ПараметрыОжидания);
   
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗаполнитьНаСервере(Период)

    //ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, "Обработки.ВКМ_МассовоеСозданиеАктов.ФормированиеАктов", Период);
    
    Запрос = Новый Запрос;
    Запрос.Текст =
    	"ВЫБРАТЬ
    	|	ОбработкаЗаказовОбороты.Договор КАК Договор,
    	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
    	|ИЗ
    	|	РегистрНакопления.ОбработкаЗаказов.Обороты(&ПериодНачала, &ПериодКонец,,) КАК ОбработкаЗаказовОбороты
    	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
    	|		ПО ОбработкаЗаказовОбороты.Договор = РеализацияТоваровУслуг.Договор
    	|		И РеализацияТоваровУслуг.Основание = ОбработкаЗаказовОбороты.Заказ
    	|ГДЕ
    	|	ОбработкаЗаказовОбороты.Договор.ВидДоговора = &ВидДоговора
    	|	И РеализацияТоваровУслуг.Дата МЕЖДУ &ПериодНачала И &ПериодКонец
    	|	И НЕ РеализацияТоваровУслуг.ПометкаУдаления";
    
    Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскаяПлата);
    Запрос.УстановитьПараметр("ПериодКонец", Период.ДатаОкончания);
    Запрос.УстановитьПараметр("ПериодНачала", Период.ДатаНачала);
    
    РезультатЗапроса = Запрос.Выполнить();
    
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		 
		Если Объект.АктыПоАбонентДоговорам.НайтиСтроки(Новый Структура("Договор", ВыборкаДетальныеЗаписи.Договор)).Количество() = 0 И
			Объект.АктыПоАбонентДоговорам.НайтиСтроки(Новый Структура("РеализацияТИУ", ВыборкаДетальныеЗаписи.Ссылка)).Количество() = 0 Тогда  
			СтрокаТЧ = Объект.АктыПоАбонентДоговорам.Добавить(); 
			СтрокаТЧ.Договор = ВыборкаДетальныеЗаписи.Договор;
			СтрокаТЧ.РеализацияТИУ = ВыборкаДетальныеЗаписи.Ссылка;  
		КонецЕсли;	
		
	КонецЦикла;
    

   ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, "Обработки.ВКМ_МассовоеСозданиеАктов.ФормированиеАктов", Период);
   Возврат ДлительнаяОперация;
    
КонецФункции

&НаКлиенте
Процедура ЗавершенитьПроцедуру(Результат, ДополнительныеПараметры) Экспорт

    Если Результат = Неопределено Тогда     
        Возврат;
    Иначе
    	Сообщить("Операция завершена")
    КонецЕсли;

КонецПроцедуры

#КонецОбласти
