
#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	ПродолжительностьОтпуска()
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	ПродолжительностьОтпуска()
КонецПроцедуры


#КонецОбласти



#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АнализГрафика(Команда) 
	
	 ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", Новый Структура ("АдресДанных", АдресДанных));
		
КонецПроцедуры

#КонецОбласти



#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПродолжительностьОтпуска()
	
	ТЧОтпуска = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	ТЧОтпуска.ОбщаяПродолжительностьОтпуска = (НачалоДня(ТЧОтпуска.ДатаОкончания) - НачалоДня(ТЧОтпуска.ДатаНачала)) / (60 * 60 * 24) + 1 ; 
	
	Если ТЧОтпуска.ОбщаяПродолжительностьОтпуска > 28 Тогда
		РазницаДнейОтпуска = ТЧОтпуска.ОбщаяПродолжительностьОтпуска - 28;
	
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("У сотрудника %1,превышен лимит отпускных дней на %2", 
					ТЧОтпуска.Сотрудник, РазницаДнейОтпуска);
			Сообщение.Сообщить(); 				
	КонецЕсли;  
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
		
	ТЧОтпускаСотрудников = Объект.ОтпускаСотрудников.Выгрузить(); 
	АдресДанных = ПоместитьВоВременноеХранилище(ТЧОтпускаСотрудников , УникальныйИдентификатор);    
	
КонецПроцедуры

#КонецОбласти
