#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
			
	ДиаграммаОтпусков.Очистить(); 
	
	ДиаграммаОтпусков.Обновление = Ложь;
	
	Серия = ДиаграммаОтпусков.УстановитьСерию("Отпуск");
	
	ГрафикОтпусков = ПолучитьИзВременногоХранилища(Параметры.АдресДанных);  		
	
	
	Для Каждого Строка Из ГрафикОтпусков Цикл  
		
		Точка = ДиаграммаОтпусков.УстановитьТочку(Строка.Сотрудник);   
						
		Значение = ДиаграммаОтпусков.ПолучитьЗначение(Точка,Серия);
		
		Интервал = Значение.Добавить();
		Интервал.Начало = НачалоДня(Строка.ДатаНачала);
		Интервал.Конец = КонецДня(Строка.ДатаОкончания);  
		
	КонецЦикла;	 
	
	ДиаграммаОтпусков.Обновление = Истина;
	
КонецПроцедуры  

#КонецОбласти



