

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

Запрос = Новый Запрос;
Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_ДополнительныеНачисления.Сотрудник КАК Сотрудник,
	|	ВКМ_ДополнительныеНачисления.Премия КАК Премия,
	|	ВКМ_ДополнительныеНачисления.НДФЛ КАК НДФЛ,
	|	ВКМ_ДополнительныеНачисления.Подразделение КАК Подразделение
	|ИЗ
	|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
	|ГДЕ
	|	ВКМ_ДополнительныеНачисления.Регистратор = &Регистратор";

Запрос.УстановитьПараметр("Регистратор", Ссылка);

РезультатЗапроса = Запрос.Выполнить();

ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Сумма = ВыборкаДетальныеЗаписи.Премия - ВыборкаДетальныеЗаписи.НДФЛ;  
КонецЦикла;

	
	 Для Каждого Строка Из СписокСотрудников Цикл 
		  
		  Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		  Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.Премия;
		  Движение.ПериодДействияНачало = НачалоМесяца(Дата);
		  Движение.ПериодДействияКонец = КонецМесяца(Дата);
		  Движение.ПериодРегистрации = Дата;
		  Движение.Сотрудник = Строка.Сотрудник;
		  Движение.Подразделение = Строка.Подразделение;
		  Движение.Премия = Строка.СуммаПремии;
		  Движение.НДФЛ = Движение.Премия * 13 / 100;
		  
		  ДвижениеУдержание = Движения.ВКМ_Удержания.Добавить();
		  ДвижениеУдержание.ПериодРегистрации = Дата;
		  ДвижениеУдержание.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		  ДвижениеУдержание.ПериодДействияНачало = НачалоМесяца(Дата);
		  ДвижениеУдержание.ПериодДействияКонец = КонецМесяца(Дата);
		  ДвижениеУдержание.Сотрудник = Строка.Сотрудник;
		  ДвижениеУдержание.Подразделение = Строка.Подразделение;
		  ДвижениеУдержание.НДФЛ = Движение.НДФЛ; 

		 		  
	  КонецЦикла;
	  
	  Движения.ВКМ_ДополнительныеНачисления.Записать(); 
	  Движения.ВКМ_Удержания.Записать();
	  Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать(); 
	
КонецПроцедуры

#КонецОбласти	

#КонецЕсли	