#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ФормированиеАктов(Период) Экспорт
    //лдя выполнения автозаполнения необ чтобы уже существаовал заказ покупателя
    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ
        |	ОбработкаЗаказовОбороты.Договор КАК Договор,
        |	0 КАК Реализация,
        |	ОбработкаЗаказовОбороты.Заказ КАК Заказ
        |ПОМЕСТИТЬ ВременнаяТаблица
        |ИЗ
        |	РегистрНакопления.ОбработкаЗаказов.Обороты(&ПериодНачала, &ПериодКонец,,) КАК ОбработкаЗаказовОбороты
        |ГДЕ
        |	ОбработкаЗаказовОбороты.Договор.ВидДоговора = &ВидДоговора
        |
        |ОБЪЕДИНИТЬ ВСЕ
        |
        |ВЫБРАТЬ
        |	РеализацияТоваровУслуг.Договор,
        |	РеализацияТоваровУслуг.Ссылка,
        |	РеализацияТоваровУслуг.Основание
        |ИЗ
        |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
        |ГДЕ
        |	РеализацияТоваровУслуг.Дата МЕЖДУ &ПериодНачала И &ПериодКонец
        |	И НЕ РеализацияТоваровУслуг.ПометкаУдаления
        |	И РеализацияТоваровУслуг.Договор.ВидДоговора = &ВидДоговора
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |	ВременнаяТаблица.Договор КАК Договор,
        |	МАКСИМУМ(ВременнаяТаблица.Реализация) КАК Реализация,
        |	ВременнаяТаблица.Заказ КАК Заказ
        |ПОМЕСТИТЬ ВТ_РеалЗаказ
        |ИЗ
        |	ВременнаяТаблица КАК ВременнаяТаблица
        |СГРУППИРОВАТЬ ПО
        |	ВременнаяТаблица.Договор,
        |	ВременнаяТаблица.Заказ
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |	ВТ_РеалЗаказ.Договор КАК Договор,
        |	ВТ_РеалЗаказ.Реализация КАК Реализация,
        |	ВТ_РеалЗаказ.Заказ КАК Заказ,
        |	ЗаказПокупателя.Организация КАК Организация,
        |	ЗаказПокупателя.Контрагент КАК Контрагент,
        |	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента
        |ИЗ
        |	ВТ_РеалЗаказ КАК ВТ_РеалЗаказ
        |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК ЗаказПокупателя
        |		ПО ВТ_РеалЗаказ.Заказ = ЗаказПокупателя.Ссылка";
    
    Запрос.УстановитьПараметр("ПериодНачала", Период.ДатаНачала);
    Запрос.УстановитьПараметр("ПериодКонец", Период.ДатаОкончания);
    Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскаяПлата);
    
    РезультатЗапроса = Запрос.Выполнить();
    
    Выборка = РезультатЗапроса.Выбрать();
   
    Пока Выборка.Следующий() Цикл 
    		   
    	Если НЕ ЗначениеЗаполнено(Выборка.Реализация) Тогда 
  
    		НоваяРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			НоваяРеализация.Дата = НачалоДня(Период.ДатаОкончания);
			НоваяРеализация.Договор = Выборка.Договор;
			НоваяРеализация.Контрагент = Выборка.Контрагент;
			НоваяРеализация.Организация = Выборка.Организация;
			НоваяРеализация.Основание = Выборка.Заказ;
			НоваяРеализация.СуммаДокумента = Выборка.СуммаДокумента;
			//НоваяРеализация.ВыполнитьАвтозаполнение();
			//НоваяРеализация.ПроверитьЗаполнение();
			НоваяРеализация.Записать(РежимЗаписиДокумента.Проведение);
    	КонецЕсли;
    КонецЦикла;
    

    
КонецФункции

#КонецОбласти

#КонецЕсли


