#Область ОбработчикиКомандФормы


&НаКлиенте
Процедура ЗаполнитьВыплаты(Команда)
	ЗаполнитьВыплатыНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
 Процедура ЗаполнитьВыплатыНаСервере()

 	Запрос = Новый Запрос;
 	Запрос.Текст =
 		"ВЫБРАТЬ
 		|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
 		|	ЕСТЬNULL(ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток, 0) КАК Сумма
 		|ИЗ
 		|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&Дата, ) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
 	
 	РезультатЗапроса = Запрос.Выполнить();
 	
 	Если РезультатЗапроса.Пустой() Тогда
		ТекстСообщения = "Нет данных для формирования зарплатной ведомости.";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
 	
 	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
 	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
		Если Объект.Выплаты.НайтиСтроки(Новый Структура("Сотрудник", ВыборкаДетальныеЗаписи.Сотрудник)).Количество() = 0 Тогда
			ЗаполнитьЗначенияСвойств(Объект.Выплаты.Добавить(), ВыборкаДетальныеЗаписи); 
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры


#КонецОбласти