
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

	Перем СообщениеТелеграммБоту; // СообщениеТелеграммБоту до записи объекта в базу  

#КонецОбласти

#Область ОбработчикиСобытий


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СообщениеТелеграммБоту = СформироватьСообщениеТелеграммБоту();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
     	
     	Возврат;
     	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СообщениеТелеграммБоту) Тогда 
		СообщениеТелеграммБоту = СтрЗаменить(СообщениеТелеграммБоту,"№Заявки",ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(Номер));
		Если Справочники.ВКМ_СообщенияДляТгБота.ДобавитьУведомление(СообщениеТелеграммБоту ) = Неопределено Тогда
			
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Формирование уведомления в справочнике. Запись не создана.", УровеньЖурналаРегистрации.Ошибка);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры



Процедура ОбработкаПроведения(Отказ, Режим)
	
	ДанныеДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор, "ВидДоговора");

	Если ДанныеДоговора.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскаяПлата Тогда 
		
		ТекстСообщения = "Выберите вид договора - Абонентская плата!!!";
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,Ссылка,"Договор","Объект",Отказ);	
		
	КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ
				|	ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора КАК ДатаНачалаДействияДоговора,
				|	ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора КАК ДатаОкончанияДействияДоговора,
				|	ДоговорыКонтрагентов.ВКМ_СтоимостьРаботЗаЧас КАК СтоимостьРаботЗаЧас
				|ИЗ
				|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
				|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
				|		ПО ВКМ_ОбслуживаниеКлиента.Договор.Наименование = ДоговорыКонтрагентов.Наименование
				|ГДЕ
				|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
			
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Если ВыборкаДетальныеЗаписи.ДатаНачалаДействияДоговора > Дата Или ВыборкаДетальныеЗаписи.ДатаОкончанияДействияДоговора < Дата Тогда
			
			         ТекстСообщения = "Выбранный договор недействителен в данный период";
			
		             ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,Ссылка,"Договор","Объект",Отказ);	
			
	           КонецЕсли;
			КонецЦикла;
			
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;      
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.ФактическиПотраченоЧасов), 0) КАК ПотраченоЧасоы,
		|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_ПотраченоЧасов
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента.ВыполненныеРаботы КАК ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПотраченоЧасов.ПотраченоЧасоы КАК ПотраченоЧасоы,
		|	ВКМ_ОбслуживаниеКлиента.Клиент КАК Клиент,
		|	ВКМ_ОбслуживаниеКлиента.Договор КАК Договор,
		|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист,
		|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_СтоимостьРаботЗаЧас КАК СтоимостьРаботЗаЧас
		|ИЗ
		|	ВТ_ПотраченоЧасов КАК ВТ_ПотраченоЧасов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|		ПО ВТ_ПотраченоЧасов.Ссылка = ВКМ_ОбслуживаниеКлиента.Ссылка
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.Период = Дата;
		Движение.Клиент = ВыборкаДетальныеЗаписи.Клиент;
		Движение.Сотрудник = ВыборкаДетальныеЗаписи.Специалист;
		Движение.Договор = ВыборкаДетальныеЗаписи.Договор;	
		Движение.КоличествоЧасов = ВыборкаДетальныеЗаписи.ПотраченоЧасоы ;
		Движение.СуммаКОплате = ВыборкаДетальныеЗаписи.ПотраченоЧасоы * ВыборкаДетальныеЗаписи.СтоимостьРаботЗаЧас;
	КонецЦикла;

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРаботы
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Дата, Сотрудник = &Сотрудник) КАК
	|		ВКМ_УсловияОплатыСотрудниковСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Сотрудник", Специалист);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если  Выборка.Следующий() Тогда
		
		
	//этот регистр записывается после записи и закрытия документа	
	Движения.ВКМ_ВыполненныеСтрудникомРаботы.Записывать = Истина;
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.ФактическиПотраченоЧасов), 0) КАК ПотраеноЧасов,
		|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_ВыпЧасов
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента.ВыполненныеРаботы КАК ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист,
		|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_СтоимостьРаботЗаЧас КАК ДоговорВКМ_СтоимостьРаботЗаЧас,
		|	ВТ_ВыпЧасов.ПотраеноЧасов КАК ПотраеноЧасов
		|ПОМЕСТИТЬ ВТ_ДанныеОбсл
		|ИЗ
		|	ВТ_ВыпЧасов КАК ВТ_ВыпЧасов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|		ПО ВТ_ВыпЧасов.Ссылка = ВКМ_ОбслуживаниеКлиента.Ссылка
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеОбсл.Специалист КАК Специалист,
		|	ВТ_ДанныеОбсл.ДоговорВКМ_СтоимостьРаботЗаЧас КАК СтоимостьРаботЗаЧас,
		|	ВТ_ДанныеОбсл.ПотраеноЧасов КАК ПотраеноЧасов,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРаботы КАК ПроцентОтРаботы
		|ИЗ
		|	ВТ_ДанныеОбсл КАК ВТ_ДанныеОбсл
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
		|		ПО ВТ_ДанныеОбсл.Специалист = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	  Движение = Движения.ВКМ_ВыполненныеСтрудникомРаботы.Добавить();
	  Движение.Период = Дата;
	  Движение.Сотрудник = ВыборкаДетальныеЗаписи.Специалист;
	  Движение.ЧасовКОплате = ВыборкаДетальныеЗаписи.ПотраеноЧасов;
	  Движение.СуммаКоплате = ВыборкаДетальныеЗаписи.ПотраеноЧасов * ВыборкаДетальныеЗаписи.СтоимостьРаботЗаЧас * ВыборкаДетальныеЗаписи.ПроцентОтРаботы / 100;
	КонецЦикла;	
	
	Иначе   
		ТекстСообщения = СтрШаблон("Документ не проведен! У сотрудника %1  не установлен  процент оплаты от выполненных работ.", Специалист);	
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,Ссылка,,,Отказ);	
		
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьСообщениеТелеграммБоту()
	
	ТекстСообщения = "";
	Если ЭтоНовый() Тогда
		
		ТекстСообщения = "Создана новая заявка";
		
	Иначе
		
		ДанныеПроведенногоДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка,
		"ДатаПроведенияРабот, ВремяНачалаРабот, ВремяОкончанияРабот, Специалист");
		
		НовыйДокумент = Новый Структура;
		НовыйДокумент.Вставить("ДатаПроведенияРабот", ДатаПроведенияРабот);
		НовыйДокумент.Вставить("ВремяНачалаРабот", ВремяНачалаРабот);
		НовыйДокумент.Вставить("ВремяОкончанияРабот", ВремяОкончанияРабот);
		НовыйДокумент.Вставить("Специалист", Специалист);
		
		Если  Не ОбщегоНазначения.ДанныеСовпадают(ДанныеПроведенногоДокумента, НовыйДокумент) Тогда
			
			ТекстСообщения = "Произошли изменения в заявке";
			
		КонецЕсли;
		
	КонецЕсли;
		
	ТекстСообщения = СтрШаблон("%1 Заявка от %2, Контрагент %3, Дата  %4 с %5 по %6, Специалист: %7",ТекстСообщения, 
						Формат(Дата,"ДФ=dd.MM.yyyy"), Клиент, Формат(ДатаПроведенияРабот,"ДФ=dd.MM.yyyy"),
						Формат(ВремяНачалаРабот,"ДФ=ЧЧ.мм"),Формат(ВремяОкончанияРабот,"ДФ=ЧЧ.мм"), Специалист);
	
    Возврат ТекстСообщения; 
	
КонецФункции
   

#КонецОбласти


#КонецЕсли