
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	#Область ОбработчикиСобытий
	
	Процедура ОбработкаПроведения(Отказ, Режим)
		
	Движения.ВКМ_ОтпускаСотрудников.Записывать = Истина;
	
	Для Каждого ТекСтрокаОтпускаСотрудников Из ОтпускаСотрудников Цикл	
	
	Движение = Движения.ВКМ_ОтпускаСотрудников.Добавить();
	Движение.Период = Дата;
	Движение.Сотрудник = ТекСтрокаОтпускаСотрудников.Сотрудник;
	Движение.КоличествоДнейВОтпуске = ТекСтрокаОтпускаСотрудников.ОбщаяПродолжительностьОтпуска;
	
	КонецЦикла;
		
	КонецПроцедуры
	
	
	#КонецОбласти
	
	#КонецЕсли